---
title: RebarSystemFailures
classe: Autodesk.Revit.DB.BuiltInFailures+RebarSystemFailures
namespace: Autodesk.Revit.DB
eredita: System.Object
revit: "2025"
revitapi: "25.4.30.0"
stato: auto
verbo: leggere
membri_n: 31
---

# RebarSystemFailures

!!! note "Scheda automatica"
    La corrispondenza C#→Python è generata dalle 7 Regole. Descrizione, tranello ed esempio sono **da rivedere** — contribuisci.

## La classe

_(una frase: cos'è e a cosa serve)_

## La corrispondenza

| nella doc (C#) | in python | tipo |
|---|---|---|
| `FailureDefinitionId AreaReinforcementOutSideOfHost { get; }` | `RebarSystemFailures.AreaReinforcementOutSideOfHost` | FailureDefinitionId |
| `FailureDefinitionId AreaReinforcementRegenFail { get; }` | `RebarSystemFailures.AreaReinforcementRegenFail` | FailureDefinitionId |
| `FailureDefinitionId AreaReinforcementsCollision { get; }` | `RebarSystemFailures.AreaReinforcementsCollision` | FailureDefinitionId |
| `FailureDefinitionId AreaReinforcementWrongHost { get; }` | `RebarSystemFailures.AreaReinforcementWrongHost` | FailureDefinitionId |
| `FailureDefinitionId BarsTooCloseNumber { get; }` | `RebarSystemFailures.BarsTooCloseNumber` | FailureDefinitionId |
| `FailureDefinitionId BarsTooCloseSpacing { get; }` | `RebarSystemFailures.BarsTooCloseSpacing` | FailureDefinitionId |
| `FailureDefinitionId BarsTooSparseSpacing { get; }` | `RebarSystemFailures.BarsTooSparseSpacing` | FailureDefinitionId |
| `FailureDefinitionId CannotPlaceAreaReinforcement { get; }` | `RebarSystemFailures.CannotPlaceAreaReinforcement` | FailureDefinitionId |
| `FailureDefinitionId CannotPlaceAreaReinforcementWarn { get; }` | `RebarSystemFailures.CannotPlaceAreaReinforcementWarn` | FailureDefinitionId |
| `FailureDefinitionId CannotPlaceAreaReininforcement { get; }` | `RebarSystemFailures.CannotPlaceAreaReininforcement` | FailureDefinitionId |
| `FailureDefinitionId CannotPlaceAreaReininforcementWarn { get; }` | `RebarSystemFailures.CannotPlaceAreaReininforcementWarn` | FailureDefinitionId |
| `FailureDefinitionId CannotPlacePathReinforcement { get; }` | `RebarSystemFailures.CannotPlacePathReinforcement` | FailureDefinitionId |
| `FailureDefinitionId CannotPlacePathReinforcementWarn { get; }` | `RebarSystemFailures.CannotPlacePathReinforcementWarn` | FailureDefinitionId |
| `FailureDefinitionId CannotPlacePathReininforcement { get; }` | `RebarSystemFailures.CannotPlacePathReininforcement` | FailureDefinitionId |
| `FailureDefinitionId CannotPlacePathReininforcementWarn { get; }` | `RebarSystemFailures.CannotPlacePathReininforcementWarn` | FailureDefinitionId |
| `FailureDefinitionId CannotUseAreaReinforcementHookTypeStyle { get; }` | `RebarSystemFailures.CannotUseAreaReinforcementHookTypeStyle` | FailureDefinitionId |
| `FailureDefinitionId CannotUsePathReinforcementHookTypeStyle { get; }` | `RebarSystemFailures.CannotUsePathReinforcementHookTypeStyle` | FailureDefinitionId |
| `FailureDefinitionId DPartReinfDeletedEditDivision { get; }` | `RebarSystemFailures.DPartReinfDeletedEditDivision` | FailureDefinitionId |
| `FailureDefinitionId DPartReinforcementDeleted { get; }` | `RebarSystemFailures.DPartReinforcementDeleted` | FailureDefinitionId |
| `FailureDefinitionId HostFlagAreaOff { get; }` | `RebarSystemFailures.HostFlagAreaOff` | FailureDefinitionId |
| `FailureDefinitionId HostFlagAreaOn { get; }` | `RebarSystemFailures.HostFlagAreaOn` | FailureDefinitionId |
| `FailureDefinitionId HostFlagPathOff { get; }` | `RebarSystemFailures.HostFlagPathOff` | FailureDefinitionId |
| `FailureDefinitionId HostFlagPathOn { get; }` | `RebarSystemFailures.HostFlagPathOn` | FailureDefinitionId |
| `FailureDefinitionId InvalidLapSpliceInAreaReinforcement { get; }` | `RebarSystemFailures.InvalidLapSpliceInAreaReinforcement` | FailureDefinitionId |
| `FailureDefinitionId LessThanTwoBars { get; }` | `RebarSystemFailures.LessThanTwoBars` | FailureDefinitionId |
| `FailureDefinitionId PathReinforcementWrongHost { get; }` | `RebarSystemFailures.PathReinforcementWrongHost` | FailureDefinitionId |
| `FailureDefinitionId RebarSystemOffset { get; }` | `RebarSystemFailures.RebarSystemOffset` | FailureDefinitionId |
| `FailureDefinitionId ThinHostFloor { get; }` | `RebarSystemFailures.ThinHostFloor` | FailureDefinitionId |
| `FailureDefinitionId ThinHostFloorError { get; }` | `RebarSystemFailures.ThinHostFloorError` | FailureDefinitionId |
| `FailureDefinitionId ThinHostWall { get; }` | `RebarSystemFailures.ThinHostWall` | FailureDefinitionId |
| `FailureDefinitionId ThinHostWallError { get; }` | `RebarSystemFailures.ThinHostWallError` | FailureDefinitionId |

## Il tranello

_(ciò che la pagina non dice e ti farebbe sbagliare)_

## Lo script

```python
# esempio da completare
```